load-test-results/load-test-results-20260310-heavy-vegeta-1000rps-300s.txt
Heavy Load Test (Vegeta)
Date: 2026-03-10
Target: http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/
Profile: 1000 req/s for 300s

Vegeta Report:
Requests      [total, rate, throughput]         300000, 1000.00, 979.41
Duration      [total, attack, wait]             5m0s, 5m0s, 172.574ms
Latencies     [min, mean, 50, 90, 95, 99, max]  136.61ms, 1.637s, 169.931ms, 3.24s, 6.543s, 30s, 30.091s
Bytes In      [total, mean]                     11759640, 39.20
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           98.00%
Status Codes  [code:count]                      0:6009  200:293991  
Error Set:
Get "http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/": read tcp 172.17.0.2:50773->15.135.248.64:80: read: connection reset by peer
Get "http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/": read tcp 172.17.0.2:34141->15.135.248.64:80: read: connection reset by peer
Get "http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/": read tcp 172.17.0.2:53047->15.135.248.64:80: read: connection reset by peer
Get "http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/": read tcp 172.17.0.2:40751->15.135.248.64:80: read: connection reset by peer
Get "http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/": read tcp 172.17.0.2:38739->15.135.248.64:80: read: connection reset by peer
Get "http://aab78d04b064f4586bf658db07d709d7-1010331570.ap-southeast-2.elb.amazonaws.com/": context deadline exceeded (Client.Timeout exceeded while awaiting headers)

HPA Snapshot:
NAME                REFERENCE                  TARGETS       MINPODS   MAXPODS   REPLICAS   AGE
go-api-hpa          Deployment/go-api          cpu: 1%/70%   1         5         1          14h
python-worker-hpa   Deployment/python-worker   cpu: 1%/75%   1         3         1          14h

go-api-hpa Events:
Events:
  Type    Reason             Age                 From                       Message
  ----    ------             ----                ----                       -------
  Normal  SuccessfulRescale  46m                 horizontal-pod-autoscaler  New size: 2; reason: cpu resource utilization (percentage of request) above target
  Normal  SuccessfulRescale  44m                 horizontal-pod-autoscaler  New size: 3; reason: cpu resource utilization (percentage of request) above target
  Normal  SuccessfulRescale  37m                 horizontal-pod-autoscaler  New size: 2; reason: All metrics below target
  Normal  SuccessfulRescale  36m (x4 over 162m)  horizontal-pod-autoscaler  New size: 1; reason: All metrics below target